; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 101255 2 3 2 3 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph0 - mode
	image1 - mode
	GroundStation2 - direction
	Star1 - direction
	Star0 - direction
	Planet3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star1)
	(supports instrument4 spectrograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite0 Star0)
	(have_image Planet3 spectrograph0)
	(have_image Star4 image1)
	(have_image Phenomenon5 spectrograph0)
	(have_image Phenomenon6 spectrograph0)
	(have_image Star7 image1)
	(have_image Star8 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (turn_to satellite0 star0 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star0)
   goals met: 1 of 7
3. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 7
4. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 1 of 7
5. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   goals met: 0 of 7
6. (turn_to satellite1 star8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star8)
   goals met: 0 of 7
7. (turn_to satellite0 star4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star4)
   goals met: 0 of 7
8. (take_image satellite1 star8 instrument4 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 1 of 7
9. (turn_to satellite0 planet3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet3)
   goals met: 1 of 7
10. (turn_to satellite1 star7 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star7)
   goals met: 1 of 7
11. (turn_to satellite0 phenomenon6 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 7
12. (take_image satellite1 star7 instrument4 image1)
   added: (have_image star7 image1)
   goals met: 2 of 7
13. (turn_to satellite0 planet3 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet3)
   goals met: 2 of 7
14. (turn_to satellite1 star4 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star4)
   goals met: 2 of 7
15. (turn_to satellite0 phenomenon6 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 7
16. (take_image satellite1 star4 instrument4 image1)
   added: (have_image star4 image1)
   goals met: 3 of 7
17. (turn_to satellite0 phenomenon5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 7
18. (turn_to satellite1 planet3 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet3)
   goals met: 3 of 7
19. (turn_to satellite0 phenomenon6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 7
20. (take_image satellite1 planet3 instrument4 spectrograph0)
   added: (have_image planet3 spectrograph0)
   goals met: 4 of 7
21. (turn_to satellite0 groundstation2 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 7
22. (turn_to satellite1 phenomenon5 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 phenomenon5)
   goals met: 4 of 7
23. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 4 of 7
24. (take_image satellite1 phenomenon5 instrument4 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   goals met: 5 of 7
25. (turn_to satellite0 star0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star0)
   goals met: 6 of 7
26. (turn_to satellite1 phenomenon6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon6)
   goals met: 6 of 7
27. (take_image satellite1 phenomenon6 instrument4 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 7 of 7
